import os.path

from PIL import Image



class q1:
    def files(destdir):
        

        files = [ f for f in os.listdir(destdir) if os.path.isfile(os.path.join(destdir,f)) ]

        print(files)

    def pictures(path1,number, search=-1, w=200, h=300):
        path = 'q1_1/'
        sklad = {1: ['Дайте определение системы m линейных алгебраических уравнений c n неизвестными. Какая СЛАУ называется однородной, неоднородной. Приведите соответствующие примеры. Может ли неоднородная СЛАУ Ax = b быть неопределенной, если столбцы её матрицы линейно независимы (линейно зависимы)? Ответ необходимо обосновать.', 
                    [Image.open(f'{path1}/{path}/1/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/1') if os.path.isfile(os.path.join(f'{path1}/{path}/1', f))]]],
                    2: ['Cформулируйте определение редуцированной ступенчатой формы СЛАУ. Сформулируйте теорему о приведении СЛАУ к редуцированной ступенчатой форме. Может ли неоднородная СЛАУ Ax = b быть совместной (несовмсетной), если соответствующая однородная СЛАУ является определенной (неопределенной)?',
                    [Image.open(f'{path1}/{path}/2/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/2') if os.path.isfile(os.path.join(f'{path1}/{path}/2', f))]]],
                 3: ['Дайте определение ранга матрицы. Сформулируйте теорему Кронекера-Капелли. Совместна или несовместна СЛАУ, если столбцы её расширенной матрицы линейно незавсисимы (линейно зависимы)? Ответ необходимо обосновать.', 
                    [Image.open(f'{path1}/{path}/3/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/3') if os.path.isfile(os.path.join(f'{path1}/{path}/3', f))]]],
                    4: [' Дайте определение фундаментальной системы решений (ФСР) однородной СЛАУ. Сформулируйте теорему об общем виде решения однородной (неоднородной) СЛАУ. Приведите соответствующие примеры. Найдите ФСР однородного уравнения 2x1 + 3x2 −3x3 + 4x4 − 7x5 = 0. ', 
                    [Image.open(f'{path1}/{path}/4/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/4') if os.path.isfile(os.path.join(f'{path1}/{path}/4', f))]]],
                    5: [' Дайте определение матрицы размеры m × n и сформулируйте основные операции над ними. Какие матрицы называются симметрическими, кососимметричсекими? Приведите соответствующие примеры. Можно ли квадратную матрицу представить в виде суммы симметрической и кососимметрической матриц? Ответ необходимо обосновать', 
                    [Image.open(f'{path1}/{path}/5/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/5') if os.path.isfile(os.path.join(f'{path1}/{path}/5', f))]]],
                   6: ['Дайте определение произведения матриц и сформулируйте основные свойства произведения матриц. Существуют ли ненулевые квадратные матрицы A и B такие, что A·B = 0? Ответ необходимо обосновать. Какие матрицы называются коммутирующими? Верно ли равенство (A · B) T = BT · AT ? Ответ необходимо обосновать.', 
                    [Image.open(f'{path1}/{path}/6/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/6') if os.path.isfile(os.path.join(f'{path1}/{path}/6', f))]]],
                    7: ['Дайте определение прямой суммы ⊕ и произведения Кронекера ⊗ для матриц. Приведите соответствующие примеры прямой суммы и произведения Кронекера матриц. Верно ли tr(A ⊗ B) = tr(A) · tr(B)? Ответ необходимо обосновать. ', 
                    [Image.open(f'{path1}/{path}/7/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/7') if os.path.isfile(os.path.join(f'{path1}/{path}/7', f))]]],
                    8: [' Какие матрицы называются обратимыми? Сформулируйте основные свойства для обратных матриц. Докажите', 
                    [Image.open(f'{path1}/{path}/8/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/8') if os.path.isfile(os.path.join(f'{path1}/{path}/8', f))]]],
                    9: ['Сформулируйте понятие элементарной матрицы. Докажите, что P −1 ij = Pij ; Mi(α) −1 = Mi 1 α  ; [Aji(α)]−1 = Aji(−α). Приведите соответствующие примеры', 
                    [Image.open(f'{path1}/{path}/9/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/9') if os.path.isfile(os.path.join(f'{path1}/{path}/9', f))]]],
                    10: ['Сформулируйте алгоритм (с обоснованием) вычисления обратной матрицы (метод ГауссаЖордана). Приведите соответствующий пример', 
                    [Image.open(f'{path1}/{path}/10/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/10') if os.path.isfile(os.path.join(f'{path1}/{path}/10', f))]]],
                    11: ['Сформулируйте критерий обратимости матрицы при помощи произведения элементарных матриц. Приведите соответствующий пример ', 
                    [Image.open(f'{path1}/{path}/11/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/11') if os.path.isfile(os.path.join(f'{path1}/{path}/11', f))]]],
                    12: [' Сформулируйте алгоритм LU разложения обратимой матрицы. Приведите соответствующий пример.', 
                    [Image.open(f'{path1}/{path}/12/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/12') if os.path.isfile(os.path.join(f'{path1}/{path}/12', f))]]],
                    13: ['Приведите определения определителей небольших порядков для матриц (n = 1, 2, 3). Приведите геометрический смысл (с обоснованием) определителей для n = 2 и n = 3.  ', 
                    [Image.open(f'{path1}/{path}/13/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/13') if os.path.isfile(os.path.join(f'{path1}/{path}/13', f))]]],
                    14: [' Дайте определние минора и алгебраического дополнения к элементам матрицы. Приведите кофакторное определение определителя матрицы n-ого порядка. Сформулируйте теорему Лапласа о разложении определителя по строке или столбцу. Найдите (середина 2 картинки) Ответ необходимо обосновать. ', 
                    [Image.open(f'{path1}/{path}/14/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/14') if os.path.isfile(os.path.join(f'{path1}/{path}/14', f))]]],
                    15: ['Приведите формулу для нахождения обратной матрицы через присоединенную матрицу adj(A). Найдите A · adj(A). Ответ необходимо обосновать.', 
                    [Image.open(f'{path1}/{path}/15/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/15') if os.path.isfile(os.path.join(f'{path1}/{path}/15', f))]]],
                    16: ['Приведите основные свойства определителей. Пусть A – кососимметрическая матрица нечетного порядка. Найдите её определитель. Ответ необходимо обосновать.  ', 
                    [Image.open(f'{path1}/{path}/16/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/16') if os.path.isfile(os.path.join(f'{path1}/{path}/16', f))]]],
                    17: [' Сформулируйте и докажите формулы Крамера. ', 
                    [Image.open(f'{path1}/{path}/17/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/17') if os.path.isfile(os.path.join(f'{path1}/{path}/17', f))]]],
                    18: [' Дайте определение минора k-ого порядка. Приведите соответствующие примеры. Пусть A ∈ Mm,n(R). Сколько различных миноров k-ого порядка может быть? Ответ необходимо обосновать. ', 
                    [Image.open(f'{path1}/{path}/18/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/18') if os.path.isfile(os.path.join(f'{path1}/{path}/18', f))]]],
                    19: [' Дайте определение ранга матрицы, используя понятие минора. Какой минор называется базисным? Сформулируйте теорему о базисном миноре. В чем состоит метод окаймляющих миноров? Приведите соответствующий пример. ', 
                    [Image.open(f'{path1}/{path}/19/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/19') if os.path.isfile(os.path.join(f'{path1}/{path}/19', f))]]],
                    20: ['Дайте определение перестановки из n элементов. Сформулируйте понятие инверсии перестановки, сигнатуры перестановки. Какая перестановка называется четной (нечетной)? Приведите соответствующие примеры. ', 
                    [Image.open(f'{path1}/{path}/20/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/20') if os.path.isfile(os.path.join(f'{path1}/{path}/20', f))]]],
                    21: ['Дайте комбинаторно-аналитическое определение определителя n -ого порядка матрицы. Приведите соответствующие примеры с обоснованием формулы определителей для n = 2, n = 3. ', 
                    [Image.open(f'{path1}/{path}/21/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/21') if os.path.isfile(os.path.join(f'{path1}/{path}/21', f))]]],
                    22: ['Дайте определение индекса перестановки. Сформулируйте теоремы Мак-Магона и ФоатаШуценберже. Проиллюстрируйте теоремы на примеры симметрической группы S4.  ', 
                    [Image.open(f'{path1}/{path}/22/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/22') if os.path.isfile(os.path.join(f'{path1}/{path}/22', f))]]],
                    
                 }
        if number == -1:
            numbers = []
            for i, j in sklad.items():
                if search in j[0]:
                    numbers.append(i)
            return 'есть в этих номерах: ', numbers
        print(sklad[number][0])
        new_img = []
        for a in sklad[number][1]:
            #while height > 1000:
            #    width /= 1.5
            #    height /= 1.5
            a = a.resize((w, h))
            new_img.append(a)
        return new_img


class q2:
    def pictures(path1,number, search=-1, w=200, h=300):
        path = 'q2_1/'
        sklad = {1: ['Дайте определение комплексного числа в алгебраической форме. Приведите тригонометрическую и показательную формы комплексного числа. Выведите формулу площади параллелограмма с вершинами в точках z1 и z2 комплексной плоскости.', 
                    [Image.open(f'{path1}/{path}/1/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/1') if os.path.isfile(os.path.join(f'{path1}/{path}/1', f))]]],
                 2: ['Выведите формулы для извлечения корня n-ой степени из комплексного числа и приведите геометрическую интерпретацию о расположении n значений корня. Какой корень называется примитивным. Приведите свойства примитивных корней.',
                     [Image.open(f'{path1}/{path}/2/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/2') if os.path.isfile(os.path.join(f'{path1}/{path}/2', f))]]],
                 3: ['(картинок нет)Дайте определение наибольшего общего делителя многочленов, наименьшего общего кратного многочленов. Приведите линейное разложение наибольшего общего делителя. Какие многочлены называются взаимно простыми? Приведите соответствующие примеры. Найдите многочлены u(x) и v(x) такие, что (2x^3 − 7x^2 − 9x + 63)u(x) + (x^3 + x^2 − 19x − 9)v(x) = 1.'+
                     '\n Решение: Наибольшим общим делителем НОД (f, g) = (f, g), где f, g ∈ R[x], называется многочлен d(x) ∈ R[x] максимальной степени, на который делятся (без остатка) оба многочлена.\nОбозначение: d(x) = НОД(f, g) = (f, g).\nОпределение. Наименьшим общим кратным НОК(f,g) = (f,g), где f,g ∈ R[x], называется многочлен L(x) ∈ R[x] наименьшей степени, который де- лится (без остатка) на каждый из многочленов f(x) и g(x).\nОбозначение: L(x) = НОK(f, g). \nТеорема. 1) Для ∀f, g ∈ R[x] найдутся d = НОД(f, g) и L = НОK(f, g).\n2) (The polynomial extended euclidean algorithm) При помощи алгоритма\nЕвклида найдутся многочлены u, v ∈ R[x] такие, что fu + gv = НОД(f, g) = d.\nОпределение. Многочлены f, g ∈ R[x] называются взаимно-простыми, если d = НОД(f,g) = 1.\nПример: Пусть p(x) = x**3 - x**2 + x - 1 ; q(x) = x**3 -x**2 + 1, то НОД(p,q) = 1 => они взаимнопростые',
                     [Image.open(f'{path1}/{path}/3/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/3') if os.path.isfile(os.path.join(f'{path1}/{path}/3', f))]]],
                 4: ['Дайте определение неприводимого многочлена. Будет ли неприводимым многочленом над R многочлен вида x^4 + 4? Ответ необходимо обосновать.'+
                     '\n Решение: Многочлен f ненулевой степени из R[x] (или C[x], в общем слу- чае K[x]) называется неприводимым (или неприводимым над полем K), ес- ли он не делится ни на какой другой многочлен g ∈ R[x] меньшей степени, 0 < deg(g) < deg(f).\nНе будет. Он приводим над R так как он делится на другие многочлены меньшей степени которые принадлежат R, разложение:',
                     [Image.open(f'{path1}/{path}/4/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/4') if os.path.isfile(os.path.join(f'{path1}/{path}/4', f))]]],
                 5: ['Дайте определение алгебраической кратности корня многочлена. Приведите соответствующие примеры. Сформулируйте основную теорему алгебры комплексных чисел. Является ли поле C алгебраически замкнутым? Ответ необходимо обосновать.',
                     [Image.open(f'{path1}/{path}/5/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/5') if os.path.isfile(os.path.join(f'{path1}/{path}/5', f))]]],
                 6: ['Приведите (с выводом) формулы Виета для многочлена f ∈ C[z], deg(f) = n',
                     [Image.open(f'{path1}/{path}/6/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/6') if os.path.isfile(os.path.join(f'{path1}/{path}/6', f))]]],
                 7: ['Приведите свойства (с доказательством) комплексных корней для многочленов с вещественными коэффициентами f ∈ R[z], deg(f) = n. Разложите на множители над R многочлен x^5 − 1 ∈ R[x].',
                     [Image.open(f'{path1}/{path}/7/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/7') if os.path.isfile(os.path.join(f'{path1}/{path}/7', f))]]],
                 8: ['Дайте определение многочлена от нескольких переменных. Какой многочлен называется симметричеcким? Приведите выражения основных симметрических многочленов.',
                     [Image.open(f'{path1}/{path}/8/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/8') if os.path.isfile(os.path.join(f'{path1}/{path}/8', f))]]],
                 9: ['Приведите формулы элементарных симметрических многочленов sk(x1, x2, . . . , xn). Укажите их в явном виде для случая n = 4, k = 4.',
                     [Image.open(f'{path1}/{path}/9/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/9') if os.path.isfile(os.path.join(f'{path1}/{path}/9', f))]]],
                 10: ['Приведите формулы Ньютона, которые связывают многочлены Ньютона (степенные суммы) с элементарными симметрическими многочленами sk(x1, x2, . . . , xn).',
                     [Image.open(f'{path1}/{path}/10/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/10') if os.path.isfile(os.path.join(f'{path1}/{path}/10', f))]]],
                 11: ['Приведите основную теорему симметрических многочленов и проиллюстрируйте её на примере симметрического многочлена f(x1,x2,x3)=x1^3*x2+x2^3*x3+x3^3*x1+x1*x2^3+x2*x3^3+x3*x1^3 представив его в виде явного многочлена от элементарных симметрических многочленов.',
                     [Image.open(f'{path1}/{path}/11/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/11') if os.path.isfile(os.path.join(f'{path1}/{path}/11', f))]]],
                 12: ['Дайте определение дискриминанта мночочлена n-ой степени с комплексными коэффициентами и приведите основные свойства дискриминанта многолена. Приведите формулу для определения дискриминанта многочлена и пользуясь этой формулой найдите дискриминант многочлена f(z) = z^3 + a*z + b.' +
                      '\n Решение: *картинка0* \n 1) Дискриминант равен нулю тогда и только тогда, когда многочлен имеет кратные корни. \n2) Дискриминант является симметрическим многочленом относительно корней многочлена и поэтому является многочленом от его коэффициентов; более того, коэффициенты этого многочлена целые независимо от расширения, в котором берутся корни.\n *картинка1*',
                     [Image.open(f'{path1}/{path}/12/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/12') if os.path.isfile(os.path.join(f'{path1}/{path}/12', f))]]],
                 13: ['Дайте определение результанта двух многочленов n-ой и m-ой степеней. Приведите основные свойства результанта многочленов. Найдите многочлены u(x) и v(x) такие, что f(x)u(x) + g(x)v(x) = Res(f(x); g(x)),где f(x) = x4 − 10x2 + 1, g(x) = x4 − 4√2x3 + 6x2 + 4√2x + 1.',
                     [Image.open(f'{path1}/{path}/13/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/13') if os.path.isfile(os.path.join(f'{path1}/{path}/13', f))]]]}
        if number == -1:
            numbers = []
            for i, j in sklad.items():
                if search in j[0]:
                    numbers.append(i)
            return 'есть в этих номерах: ', numbers
        print(sklad[number][0])
        new_img = []
        for a in sklad[number][1]:
            #while height > 1000:
            #    width /= 1.5
            #    height /= 1.5
            a = a.resize((w, h))
            new_img.append(a)
        return new_img


class q3:
    def pictures(path1,number, search=-1, w=200, h=300):
        path = 'q3_1/'
        sklad = {1: ['Дайте определение линейного пространства и приведите примеры линейных пространств. Является ли линейным пространством V1 = {f ∈ R4[x] : f(5) = 0}, V2 = {f ∈ R4[x] : f(5) = 2}? Ответ необходимо обосновать.', 
                    [Image.open(f'{path1}/{path}/1/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/1') if os.path.isfile(os.path.join(f'{path1}/{path}/1', f))]]],
                 2: ['Дайте определение линейной зависимости и независимости системы векторов. Что называется базисом конечномерного векторного пространства? Как определяется размерность конечномерного векторного пространства. Найдите размерность и какой-нибудь базис линейного пространства V = {f ∈ R4[x] : f(3) = 0}.',
                     [Image.open(f'{path1}/{path}/2/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/2') if os.path.isfile(os.path.join(f'{path1}/{path}/2', f))]]],
                 3: ['Дайте определение матрицы перехода от одного базиса к другому линейного пространства. Сформулируйте основные свойства матрицы перехода. Приведите примеры матрицы перехода.',
                     [Image.open(f'{path1}/{path}/3/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/3') if os.path.isfile(os.path.join(f'{path1}/{path}/3', f))]]],
                 4: ['Дайте определение линейного подпространства. Приведете основные примеры линейных подпространств. Является ли объединение двух линейных подпространств линейным подпространством? Ответ необходимо обосновать.',
                     [Image.open(f'{path1}/{path}/4/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/4') if os.path.isfile(os.path.join(f'{path1}/{path}/4', f))]]],
                 5: ['Дайте определение пересечения, суммы линейных подпространств. Сформулируйте теорему о размерности суммы подпространств. Какая сумма называется прямой? Приведите пример суммы подпространств, которая не является прямой (с обоснованием).',
                     [Image.open(f'{path1}/{path}/5/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/5') if os.path.isfile(os.path.join(f'{path1}/{path}/5', f))]]],
                 6: ['Дайте определение линейного многообразия линейного пространства. Как определяется размерность линейного многообразия? Является ли V = {x ∈ R5: x1 − x2 + x3 − x4 − 5x5 = 0, x2 − x3 + 2x4 + 4x5 = 1} линейным многообразием? Если да, то найдите его размерность.',
                     [Image.open(f'{path1}/{path}/6/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/6') if os.path.isfile(os.path.join(f'{path1}/{path}/6', f))]]],
                 7: ['Дайте определение линейного оператора. Что называется ядром и образом линейного оператора? Как связаны дефект линейного оператора и ранг линейного оператора в конечномерном линейном пространстве.',
                     [Image.open(f'{path1}/{path}/7/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/7') if os.path.isfile(os.path.join(f'{path1}/{path}/7', f))]]],
                 8: ['Дайте определение матрицы линейного оператора. Найдите ранг линейнго оператора, если ϕ : R3 → R3, ϕ(x) = {x1; x1 + x2; x1 + x2 + x3}. Как изменится матрица линейного оператора при переходе к другому базису? Ответ необходимо обосновать.',
                     [Image.open(f'{path1}/{path}/8/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/8') if os.path.isfile(os.path.join(f'{path1}/{path}/8', f))]]],
                 9: ['Дайте определение инвариантного линейного подпространства относительно линейного оператора. Будут ли ядро и образ линейного оператора инвариантными подпространствами? Ответ необходимо обосновать.',
                     [Image.open(f'{path1}/{path}/9/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/9') if os.path.isfile(os.path.join(f'{path1}/{path}/9', f))]]],
                 10: ['Дайте определение собственного вектора и соответствующего собственного значения линейного оператора. Что называется спектром и резольвентой линейного оператора.',
                     [Image.open(f'{path1}/{path}/10/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/10') if os.path.isfile(os.path.join(f'{path1}/{path}/10', f))]]],
                 11: ['Дайте определение характеристического многочлена линейного оператора. Покажите, что характеристический многочлен не зависит от выбора базиса.',
                     [Image.open(f'{path1}/{path}/11/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/11') if os.path.isfile(os.path.join(f'{path1}/{path}/11', f))]]],
                 12: ['Дайте определение собственного подпространства линейного оператора. Как связаны алгебраическая и геометрическая кратности собственного значения. Приведите пример линейного оператора и соответствующего собственного значения, геометрическая кратность которого меньше его алгебраической кратности.',
                     [Image.open(f'{path1}/{path}/12/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/12') if os.path.isfile(os.path.join(f'{path1}/{path}/12', f))]]],
                 13: ['Дайте определение диагонализируемого оператора. Приведите критерий диагонализируемости.',
                     [Image.open(f'{path1}/{path}/13/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/13') if os.path.isfile(os.path.join(f'{path1}/{path}/13', f))]]],
                 14: ['Приведите основные свойства собственных чисел и собственных векторов линейных операторов.',
                     [Image.open(f'{path1}/{path}/14/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/14') if os.path.isfile(os.path.join(f'{path1}/{path}/14', f))]]],
                 15: ['Сформулируйте теорему Гамильтона – Кэли. Приведедите пример, иллюстрирующий теорему Гамильтона – Кэли',
                     [Image.open(f'{path1}/{path}/15/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/15') if os.path.isfile(os.path.join(f'{path1}/{path}/15', f))]]],
                 16: ['Дайте определение минимального многочлена матрицы линейного оператора. Как связаны характеристический и минимальный многочлены? Приведите пример минимального многочлена для матрицы.',
                     [Image.open(f'{path1}/{path}/16/{x}') for x in [f for f in os.listdir(f'{path1}/{path}/16') if os.path.isfile(os.path.join(f'{path1}/{path}/16', f))]]]
                 
                 }
        if number == -1:
            numbers = []
            for i, j in sklad.items():
                if search in j[0]:
                    numbers.append(i)
            return 'есть в этих номерах: ', numbers
        print(sklad[number][0])
        new_img = []
        for a in sklad[number][1]:
            #while height > 1000:
            #    width /= 1.5
            #    height /= 1.5
            a = a.resize((w, h))
            new_img.append(a)
        return new_img

class q4:
    def pictures():
        print('https://vk.cc/ckTD59')