Repository: pypi-data/pypi-mirror-187
Catalog: packages/py-lav/py_lav-1.2.3-py3-none-any.whl/pylav/players/locales/*.po
Languages: pt_br, ru_ru

source: No available nodes!
pt_br: Nenhum nó disponível!
ru_ru: Нет доступных узлов!

source: Music in {count} servers
pt_br: Música em servidores de {count}
ru_ru: Музыка на серверах {count}

source: There are no tracks currently in the player history
pt_br: Não há nenhuma faixa no histórico do jogador
ru_ru: В настоящее время нет треков в истории плеера

source: Current node has the Volume filter functionality disabled
pt_br: O nó atual tem a funcionalidade de filtro de volume desativado
ru_ru: На текущем узле отключена функция фильтра громкости

source: Current node has the Equalizer functionality disabled
pt_br: O nó atual possui a funcionalidade do Equalizador desativada
ru_ru: На текущем узле отключена функциональность эквалайзера

source: Current node has the Karaoke functionality disabled
pt_br: O nó atual possui a funcionalidade de Karaokê desativada
ru_ru: У текущего узла отключена функциональность Караука

source: Current node has the Timescale functionality disabled
pt_br: O nó atual tem a funcionalidade Timescale desativada
ru_ru: Текущий узел имеет функцию масштабирования времени отключена

source: Current node has the Tremolo functionality disabled
pt_br: O nó atual possui a funcionalidade Tremolo desativada
ru_ru: На текущем узле отключена функция Tremolo

source: Current node has the Vibrato functionality disabled
pt_br: O nó atual possui a funcionalidade Vibrato desativada
ru_ru: У текущего узла отключена функция вибрато

source: Current node has the Rotation functionality disabled
pt_br: O nó atual possui a funcionalidade de Rotação desativada
ru_ru: Функция поворота на текущем узле отключена

source: Current node has the Distortion functionality disabled
pt_br: O nó atual possui a funcionalidade de Distorção desativada
ru_ru: У текущего узла отключена функция Distortion

source: Current node has the LowPass functionality disabled
pt_br: O nó atual possui a funcionalidade do LowPass desativada
ru_ru: На текущем узле отключен функционал LowPass

source: Current node has the Echo functionality disabled
pt_br: O nó atual tem a funcionalidade Echo desativada
ru_ru: На текущем узле отключена функция Echo

source: Current node has the ChannelMix functionality disabled
pt_br: O nó atual tem a funcionalidade ChannelMix desativada
ru_ru: На текущем узле отключена функциональность ChannelMix

source: LIVE
pt_br: VIVO
ru_ru: ЖИВА

source: Now Playing in
pt_br: Reproduzindo agora
ru_ru: Сейчас играет в

source: Currently livestreaming
pt_br: Atualmente transmitindo
ru_ru: В настоящее время животноводство

source: Playing:
pt_br: Reproduzindo:
ru_ru: Играет:

source: Requester
pt_br: Solicitante
ru_ru: Запрашивающий

source: Duration
pt_br: Duração
ru_ru: Продолжительность

source: Previous Track
pt_br: Faixa Anterior
ru_ru: Предыдущий трек

source: Next Track
pt_br: Próxima faixa
ru_ru: Следующий трек

source: {track_count} tracks, {queue_total_duration} remaining
pt_br: {track_count} faixas, {queue_total_duration} restante(s)
ru_ru: {track_count} треков, {queue_total_duration} осталось

source: Repeating
pt_br: Repetindo
ru_ru: Повторение

source: Auto Play
pt_br: Reprodução Automática
ru_ru: Автозапуск

source: Volume
ru_ru: Объем

source: Recently Played for
pt_br: Reproduzido recentemente para
ru_ru: Недавно играл на

source: Queue for
pt_br: Fila para
ru_ru: Очередь для

source: Playing
pt_br: Reproduzindo
ru_ru: Играет

source: Queue order is may not be accurate due to auto-shuffle being enabled
pt_br: A ordem da fila pode não ser precisa devido ao auto-embaralhamento estar habilitado
ru_ru: Порядок очереди может быть неточным из-за включённого автосмешивания

source: Page {current_page}/{total_pages} | {track_number} tracks, {queue_total_duration} remaining
pt_br: Página {current_page}/{total_pages} £ {track_number} faixas, {queue_total_duration} restante(s)
ru_ru: Страница {current_page}/{total_pages} | {track_number} треков, {queue_total_duration} осталось
